##### test train split in time series data

In [1]:
import pandas as pd
df = pd.read_csv(r'C:\E\E_drive_copy\sample_data\ts_ud\Resources\Data + Code\us-airlines-monthly-aircraft-miles-flown.csv', parse_dates=[0])

In [3]:
df.head()

       Month  MilesMM
0 1963-01-01     6827
1 1963-02-01     6178
2 1963-03-01     7084
3 1963-04-01     8162
4 1963-05-01     8462

In [4]:
df.shape

(96, 2)

In [5]:
# 80% train

train_size = int(df.shape[0] * 0.8)

train_size

76

In [7]:
df_train = df.iloc[:76, :]
df_test = df.iloc[76:, :]

In [8]:
df_train

        Month  MilesMM
0  1963-01-01     6827
1  1963-02-01     6178
2  1963-03-01     7084
3  1963-04-01     8162
4  1963-05-01     8462
..        ...      ...
71 1968-12-01    10925
72 1969-01-01     9491
73 1969-02-01     8919
74 1969-03-01    11607
75 1969-04-01     8852

[76 rows x 2 columns]

In [9]:
df_test

        Month  MilesMM
76 1969-05-01    12537
77 1969-06-01    14759
78 1969-07-01    13667
79 1969-08-01    13731
80 1969-09-01    15110
81 1969-10-01    12185
82 1969-11-01    10645
83 1969-12-01    12161
84 1970-01-01    10840
85 1970-02-01    10436
86 1970-03-01    13589
87 1970-04-01    13402
88 1970-05-01    13103
89 1970-06-01    14933
90 1970-07-01    14147
91 1970-08-01    14057
92 1970-09-01    16234
93 1970-10-01    12389
94 1970-11-01    11595
95 1970-12-01    12772

In [10]:
# walk forward validation : taking the series till the time required for prediction and forecast
# means to predict after time t1, model uses data till t1
# to predict predict after time t2, model uses data till t2 and so on